In [1]:
%load_ext sql

### Project Overview: MySQL Database Creation and Transformation

### Table of Contents

##### A. Database Creation:
 - Create MYSQL Database  
 - Create Table
 - Insert Records Into a Table
##### B. Data Cleaning
 - Checking Null Values
 - Removing Duplicate Records By Using Different Methods:
    - MAX Function
    - Self-Join
    - Row_Number Function
    - MIN Function
    - Unique ID
    - Backup Table
##### C. Data Transformation
 - Change Data Types
 - Merge Columns
 - Splitting Column
##### D. Data Retrieving by using:
- Window Function
- Recursive Query


#### 1. Purpose/Objective:

<div style='text-align: justify;'>The purpose of this MySQL project is to demonstrate proficiency in database management and advanced SQL querying techniques through a comprehensive exploration of database creation, data cleaning, and transformation processes. The project aims to showcase  the following key aspects: 
</div/

#### A. Database Creation:

**Create MySQL Database:** Establishing the foundation of the project by creating a MySQL database environment.<br>
**Create Table:** Structuring the database by defining tables with appropriate fields and data types.<br>
**Insert Records Into a Table:** Populating the tables with sample data to facilitate subsequent data manipulation tasks.

#### B. Data Cleaning:

- **Checking Null Values:** Identifying and handling null values within the dataset to ensure data integrity.<br>
- **Removing Duplicate Records By Using Different Methods:**<br>
   - **MAX Function:** Eliminating duplicate records based on the maximum value of a specific field.<br>
   - **Self-Join:** Employing self-joins to identify and eliminate duplicate entries.<br>
   - **Row_Number Function:** Utilizing window functions to assign row numbers and filter out duplicate rows.<br>
   - **MIN Function:** Removing duplicate records based on the minimum value of a designated field.<br>
   - **Unique ID:** Generating and utilizing unique identifiers to identify and remove duplicates.<br>
   - **Backup Table:** Creating backup tables to preserve original data before performing cleaning operations.

#### C. Data Transformation:

**Change Data Types:** Modifying data types of specific columns to align with analytical requirements.<br>
**Merge Columns:** Consolidating information from multiple columns into a single field for enhanced analysis


#### D. Data Retrieving by using:

**Window Function:** Employing window functions to retrieve and analyze data within specified partitions or frames.<br>
**Recursive Query:** Utilizing recursive queries to traverse hierarchical data structures and extract valuable insights.

#### 2. Tools Used:

Throughout this project, the following tools and technologies were instrumental in its execution:

- **MySQL RDBMS:** <div style='text-align:justify;'>The relational database management system used for database creation, querying, and data manipulation tasks.<br>
</div>
- **Jupyter Notebook:** <div style='text-align:justify;'>An interactive computing environment utilized for developing, documenting, and executing SQL queries and Python scripts.<br>
</div>
- **JupyterSQL and Magic Commands:** <div style='text-align: justify;'> JupyterSQL was employed to seamlessly integrate SQL queries into Jupyter Notebooks, enhancing readability and understandability. Magic commands were utilized to streamline the execution of SQL queries and display query results clearly and concisely.<br>
   </div>                                                                                                                                                     
- **Python Libraries for Integration:**
   - **pymysql:** <div style='text-align:justify;'> Utilized as a Python MySQL client library, pymysql facilitated the connection to the MySQL database from within Python scripts. It enabled seamless execution of SQL queries and interaction with the database, enhancing the integration between MySQL and the Python environment.<br>
</div>
   - **SQLAlchemy:** <div style='text-align:justify;'> Employed as an Object-Relational Mapping (ORM) tool, SQLAlchemy provided a high-level interface for interacting with the MySQL database using Python objects. Its abstraction layer simplified database operations and offered flexibility in querying, data manipulation, and schema management, thereby enhancing productivity and code maintainability.
</div>

### A. DATABASE CREATION

#### Create MYSQL database

In [84]:
%%sql
CREATE DATABASE IF NOT EXISTS mydata_two;

++
||
++
++

#### Create a table

In [8]:
%%sql
USE mydata_two;

CREATE TABLE IF NOT EXISTS employees (
    emp_id INT, -- exclude the AUTO_INCREMENT PRIMARY KEY constraint to populate duplicate IDs
    first_name VARCHAR(50),
    last_name VARCHAR(50),
    gender VARCHAR(10), 
    age INT,
    salary INT,
    hire_date VARCHAR(50),
    department VARCHAR(50), 
    manager_id INT,
    address VARCHAR(50)
);

++
||
++
++

In [9]:
%%sql
SELECT * FROM employees

+--------+------------+-----------+--------+-----+--------+-----------+------------+------------+---------+
| emp_id | first_name | last_name | gender | age | salary | hire_date | department | manager_id | address |
+--------+------------+-----------+--------+-----+--------+-----------+------------+------------+---------+
+--------+------------+-----------+--------+-----+--------+-----------+------------+------------+---------+

#### Insert records into the table

In [10]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

 Dispaly the records.

In [11]:
%%sql

SELECT * FROM employees
LIMIT 5;

+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
| emp_id | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |        address        |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
|   1    |  Tamirat   |   Ketema  |  male  |  46 |  6000  | 2012-10-25 |    None    |    None    |    33021 456 Gonder   |
|   2    |    Bety    |    Ayle   | female |  26 |  5000  | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  |
|   3    |   Aragaw   |    Mola   |  male  |  25 |  4500  | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor |
|   4    |   Alemu    |   Asmar   |  male  |  24 |  4500  | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa |
|   5    |   Hiwot    |   Kebede  | female |  27 |  4000  | 2016-04-23 |     IT     |     6      |    33022 455 Gonder   |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+

In [ ]:
Display duplicated emp_ids.

In [12]:
%%sql
SELECT  
    emp_id,
    COUNT(*) AS num_duplicated_id
FROM employees
GROUP BY emp_id
HAVING COUNT(*) > 1;

+--------+-------------------+
| emp_id | num_duplicated_id |
+--------+-------------------+
|   17   |         2         |
+--------+-------------------+

Identify duplicate records based on **first_name** and **last_name** columns by using group by clause.

In [13]:
%%sql
SELECT  
    first_name,
    last_name,
    COUNT(*) as duplicated_records
FROM employees
GROUP BY first_name, last_name
HAVING COUNT(*) > 1;

+------------+-----------+--------------------+
| first_name | last_name | duplicated_records |
+------------+-----------+--------------------+
|   Hiwot    |   Kebede  |         2          |
|   Desta    |    Mola   |         2          |
|   Kassaw   |  Tamirat  |         2          |
|   Belay    |   Ketema  |         2          |
+------------+-----------+--------------------+

Identify duplicated records by using distinct method

In [14]:
%%sql

SELECT
    COUNT(first_name AND last_name) AS Total_records, 
    COUNT(DISTINCT first_name, last_name) AS distinct_number_of_records
FROM employees;

+---------------+----------------------------+
| Total_records | distinct_number_of_records |
+---------------+----------------------------+
|       21      |             17             |
+---------------+----------------------------+

### B. DATA CLEANING

##### CHECKING NULL VALUES

Check that manager_id, salary and department columns whether they have null values or not.

In [15]:
%%sql

SELECT *    
FROM employees
WHERE  manager_id IS NULL
UNION ALL
SELECT *
FROM employees
WHERE salary IS NULL
UNION ALL
SELECT *
FROM employees
WHERE department IS NULL ;

+--------+------------+-----------+--------+-----+--------+------------+------------+------------+------------------+
| emp_id | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |     address      |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+------------------+
|   1    |  Tamirat   |   Ketema  |  male  |  46 |  6000  | 2012-10-25 |    None    |    None    | 33021 456 Gonder |
|   1    |  Tamirat   |   Ketema  |  male  |  46 |  6000  | 2012-10-25 |    None    |    None    | 33021 456 Gonder |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+------------------+

##### REMOVING DUPLICATE RECORDS

> `1. Removing duplicate records, based on some of the columns or all columns except `ID`, by using` **MAX function**.\
 >  `   This method deletes/removes duplicate records that appear at max(ID). If there are duplicated IDs, it removes`\
 > `   all occurrences of duplicates. And it only works if a record occurs twice.`

Step1. Select duplicated records of max(emp_id)

In [16]:
%%sql
SELECT max_id   
FROM(   
    
        SELECT 
            first_name,
            last_name,
            MAX(emp_id) AS max_id
        FROM employees
        GROUP BY first_name, last_name
        HAVING COUNT(*) > 1
              ) AS subquery;

+--------+
| max_id |
+--------+
|   18   |
|   19   |
|   20   |
|   17   |
+--------+

Step2. Delete the selected duplicates max(emp_id) as max_id

In [17]:
%%sql
 
USE mydata_two;

DELETE FROM employees   
WHERE emp_id IN(    
     SELECT max_id  
     FROM(   
            SELECT 
                first_name,
                last_name,
                MAX(emp_id) AS max_id
            FROM employees
            GROUP BY first_name, last_name
            HAVING COUNT(*) > 1
              ) AS subquery
         );
COMMIT;

++
||
++
++

Step3.Check all the number of records and distinct records after removing duplicated records to compare with the distinct records before removing duplicates displayed above.

In [18]:
%%sql
SELECT 
     COUNT(*) AS Total_records, 
     COUNT(distinct first_name, last_name)AS distinct_records 
FROM employees;

+---------------+------------------+
| Total_records | distinct_records |
+---------------+------------------+
|       16      |        16        |
+---------------+------------------+

#### Repopulating the records to the employees' table to apply another method.

In [19]:
%%sql
USE mydata_two;
TRUNCATE TABLE employees;

++
||
++
++

In [20]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

> `2. Removing duplicate records, based on some of the columns or all columns except ID, by using` **self-join**.\
      >   `   This method deletes/removes the max(ID) or min(ID) from duplicate records, and it depends on the conditions` \
      >   `    that we choose. If there are duplicate `IDs`, it will not remove duplicate records appearing at duplicate IDS.`

Step1. Create sef join of employees table and select the max(emp_id) from duplicate records.

In [21]:
%%sql

SELECT e1.emp_id  FROM employees e1
INNER JOIN employees e2 
ON e1.first_name = e2.first_name AND e1.last_name = e2.last_name
WHERE e1.emp_id > e2.emp_id;

+--------+
| emp_id |
+--------+
|   18   |
|   19   |
|   20   |
+--------+

Step2. Delete duplicate records occurred at max(emp_id).

In [22]:
%%sql
USE mydata_two;

DELETE e1 FROM employees e1
INNER JOIN employees e2 ON e1.first_name = e2.first_name AND e1.last_name = e2.last_name
WHERE e1.emp_id > e2.emp_id;

COMMIT;

++
||
++
++

Count records after removing duplicate records.

In [23]:
%%sql
SELECT COUNT(*) AS num_records FROM employees;

+-------------+
| num_records |
+-------------+
|      18     |
+-------------+

Step4. Check, if there are still duplicate records in the data because the **self join** method doesn't delete duplicate records appearing at duplicate IDs.

In [24]:
%%sql
SELECT  
    first_name,
    last_name,
    COUNT(*) as duplicated_records
FROM employees
GROUP BY first_name, last_name
HAVING COUNT(*) > 1;

+------------+-----------+--------------------+
| first_name | last_name | duplicated_records |
+------------+-----------+--------------------+
|   Belay    |   Ketema  |         2          |
+------------+-----------+--------------------+

#### Repopulating the records to apply another method

In [25]:
%%sql
USE mydata_two;
TRUNCATE TABLE employees;

++
||
++
++

In [26]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

> `3. Removing duplicate records by using the ` **row_number() function**.

Step1. Create a row_number as rn

In [27]:
%%sql

SELECT *,
        row_number() over(PARTITION BY first_name, last_name) AS rn
FROM employees
;

+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+----+
| emp_id | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |        address        | rn |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+----+
|   11   |   Abebe    |   Kassaw  |  male  |  30 |  3000  | 2022-08-15 |     HR     |     14     |    33020 451 Gonder   | 1  |
|   4    |   Alemu    |   Asmar   |  male  |  24 |  4500  | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa | 1  |
|   3    |   Aragaw   |    Mola   |  male  |  25 |  4500  | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor | 1  |
|   12   |   Ayalew   |   Tamire  |  male  |  26 |  4000  | 2022-08-14 |  Finance   |     10     |  34037 301 Bahar_dar  | 1  |
|   17   |   Belay    |   Ketema  |  male  |  25 |  3500  | 2023-07-14 |  Finance   |     10     |    33035 449 Gonder   | 1  |
|   17   |   Belay    |   Ketema  |  male  |  25 |  3500  | 2023-07-14 |  Finance   |     10     |    33035 449 Gonder   | 2  |
|   2    |    Bety    |    Ayle   | female |  26 |  5000  | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  | 1  |
|   15   |   Debebe   |   Kassie  |  male  |  30 |  3500  | 2022-11-13 | Marketing  |     2      |    33027 453 Gonder   | 1  |
|   10   |   Desta    |    Mola   |  male  |  23 |  5000  | 2010-09-20 |  Finance   |     1      |  34033 306 Bahar_dar  | 1  |
|   19   |   Desta    |    Mola   |  male  |  23 |  5000  | 2010-09-20 |  Finance   |     1      |  34033 306 Bahar_dar  | 2  |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+----+
Truncated to displaylimit of 10.

Step2. Identify duplicate records by using row_number

In [28]:
%%sql

    SELECT emp_id
    FROM(
        SELECT *,
             row_number() over(PARTITION BY first_name, last_name) AS rn
        FROM employees
        ORDER BY emp_id
        ) AS subquery
    WHERE rn > 1

+--------+
| emp_id |
+--------+
|   17   |
|   18   |
|   19   |
|   20   |
+--------+

Step3. Delete duplicate records by using row_number

In [29]:
%%sql
USE mydata_two;

DELETE FROM employees
WHERE emp_id NOT IN(
        SELECT emp_id
        FROM(
            SELECT *,
                 row_number() over(PARTITION BY first_name, last_name) AS rn
            FROM employees
            ORDER BY emp_id
            ) AS subquery
         WHERE rn < 2
        );

COMMIT;

++
||
++
++

Step4. Check, if there are still duplicate records in the data because the **row_number** method doesn't delete duplicate records appearing at duplicate IDs.

In [30]:
%%sql
SELECT 
     COUNT(*) AS Total_records, 
     COUNT(distinct first_name, last_name)AS distinct_records 
FROM employees;

+---------------+------------------+
| Total_records | distinct_records |
+---------------+------------------+
|       18      |        17        |
+---------------+------------------+

Step5. Drop the row_number.

#### Repopulating the records to apply another method

In [31]:
%%sql
USE mydata_two;
TRUNCATE TABLE employees;

++
||
++
++

In [32]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

> `4.   Removing duplicate records by using the` **MIN function**.`This method is useful when there are multiple duplicate records` <br> 
  >    `     in data. Even, this method has still limitations when there are duplicate IDs. It doesn't remove duplicate records` <br> 
  >     `     appearing at duplicate IDs.`

Step1. Select duplicated records appearing at min(emp_id)

In [33]:
%%sql
SELECT min_id   
FROM(   
    SELECT 
        first_name,
        last_name,
        MIN(emp_id) AS min_id
    FROM employees
    GROUP BY first_name, last_name
    HAVING COUNT(*) > 1
    ) AS subquery;

+--------+
| min_id |
+--------+
|   5    |
|   10   |
|   16   |
|   17   |
+--------+

Step2. Delete duplicate records by preserving the min_ids.

In [34]:
%%sql
  
 USE mydata_two;  
 
DELETE FROM employees
 WHERE emp_id NOT IN(
           SELECT min_id  
           FROM (
                SELECT 
                    first_name,
                    last_name,
                    MIN(emp_id) AS min_id
                FROM employees
                GROUP BY first_name, last_name
                ) AS subquery
             );
COMMIT;

++
||
++
++

Step4. Check, if there are still duplicate records in the data because the **MIN function** method doesn't delete duplicate records appearing at duplicate IDs.

In [35]:
%%sql
SELECT 
    COUNT(*) AS num_records,
    COUNT(distinct first_name,last_name) AS distinct_records
FROM employees;

+-------------+------------------+
| num_records | distinct_records |
+-------------+------------------+
|      18     |        17        |
+-------------+------------------+

#### Repopulating the records to apply another method

In [36]:
%%sql
USE mydata_two;
TRUNCATE TABLE employees;

++
||
++
++

In [37]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

> `5. Removing duplicate records by using a` **unique ID**.`This method is the most powerful method to remove any duplicate`\
   >    `   records whether data contains multiple duplicates or duplicate IDs.`

Step1. Create a unique ID column.

In [38]:
%%sql

USE mydata_two;

ALTER TABLE employees
ADD COLUMN row_ID INT AUTO_INCREMENT PRIMARY KEY;

++
||
++
++

Step2. verify the creation of row_ID column.

In [39]:
%%sql

SELECT * FROM employees;

+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+--------+
| emp_id | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |        address        | row_ID |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+--------+
|   1    |  Tamirat   |   Ketema  |  male  |  46 |  6000  | 2012-10-25 |    None    |    None    |    33021 456 Gonder   |   1    |
|   2    |    Bety    |    Ayle   | female |  26 |  5000  | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  |   2    |
|   3    |   Aragaw   |    Mola   |  male  |  25 |  4500  | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor |   3    |
|   4    |   Alemu    |   Asmar   |  male  |  24 |  4500  | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa |   4    |
|   5    |   Hiwot    |   Kebede  | female |  27 |  4000  | 2016-04-23 |     IT     |     6      |    33022 455 Gonder   |   5    |
|   6    |  Getachew  |   Kebede  |  male  |  29 |  5000  | 2017-06-15 |     IT     |     1      |  34033 305 Bahar_dar  |   6    |
|   7    |   Kidist   |   Kebede  | female |  30 |  4500  | 2000-04-10 | Marketing  |     2      | 55075 807 Addis_Ababa |   7    |
|   8    |  Meseret   |    Ayle   | female |  26 |  3500  | 2002-07-18 |     HR     |     14     | 45074 205 Debre_tabor |   8    |
|   9    |   Gashaw   |   Kebede  |  male  |  26 |  3000  | 2000-10-13 |     HR     |     14     |    33022 457 Gonder   |   9    |
|   10   |   Desta    |    Mola   |  male  |  23 |  5000  | 2010-09-20 |  Finance   |     1      |  34033 306 Bahar_dar  |   10   |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+--------+
Truncated to displaylimit of 10.

Step3. Delete the duplicate records by using the unique ID.

In [40]:
%%sql

USE mydata_two;
    
DELETE FROM employees
WHERE row_ID IN (
           SELECT 
                 max_row_ID
           FROM(
            SELECT 
                 MAX(row_ID) AS max_row_ID           
            FROM employees
            GROUP BY first_name, last_name
            HAVING COUNT(*) > 1
               ) AS subquery
            );
COMMIT;

++
||
++
++

Step4. Verify the removal of all duplicate records. IF all duplicate records are removed, the total records are equal to the distinct records.

In [41]:
%%sql 

SELECT
    COUNT(*) AS Total_records,
    COUNT(DISTINCT first_name,last_name) AS Distinct_records

FROM employees;

+---------------+------------------+
| Total_records | Distinct_records |
+---------------+------------------+
|       17      |        17        |
+---------------+------------------+

Step5. Drop the unique ID.

In [42]:
%%sql
USE mydata_two;

ALTER TABLE employees
DROP COLUMN row_ID;

COMMIT;

++
||
++
++

#### Repopulating the records to apply another method

In [43]:
%%sql
USE mydata_two;
TRUNCATE TABLE employees;

++
||
++
++

In [44]:
%%sql
USE mydata_two;
INSERT INTO employees(emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address)
VALUES
(1, "Tamirat", "Ketema", "male", 46, 6000, "2012-10-25", NULL, NULL, "33021 456 Gonder"),
(2, "Bety", "Ayle", "female", 26, 5000, "2013-06-10", "Marketing", 1, "34034 304 Bahar_dar"),
(3, "Aragaw", "Mola", "male", 25, 4500, "2000-03-17", "IT", 6, "45076 206 Debre_tabor"),
(4, "Alemu", "Asmar", "male", 24, 4500, "2000-04-02", "Marketing", 2, "55076 809 Addis_Ababa"),
(5, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(6, "Getachew", "Kebede", "male", 29, 5000, "2017-06-15", "IT", 1, "34033 305 Bahar_dar"),
(7, "Kidist", "Kebede", "female", 30, 4500, "2000-04-10", "Marketing", 2, "55075 807 Addis_Ababa"),
(8, "Meseret", "Ayle", "female", 26, 3500, "2002-07-18", "HR", 14, "45074 205 Debre_tabor"),
(9, "Gashaw", "Kebede", "male", 26, 3000, "2000-10-13", "HR", 14, "33022 457 Gonder"),
(10, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(11, "Abebe", "Kassaw", "male", 30, 3000, "2022-08-15", "HR", 14, "33020 451 Gonder"),
(12, "Ayalew", "Tamire", "male", 26, 4000, "2022-08-14", "Finance", 10, "34037 301 Bahar_dar"),
(13, "Ketemaw", "Ketema", "male", 25, 3200, "2022-08-12", "IT", 6, "33029 457 Gonder"),
(14, "Sema", "Bitew", "male", 30, 5000, "2023-01-13", "HR", 1, "33028 452 Gonder"),
(15, "Debebe", "Kassie", "male", 30, 3500, "2022-11-13", "Marketing", 2, "33027 453 Gonder"),
(16, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(17, "Belay", "Ketema", "male", 25, 3500, "2023-07-14", "Finance", 10, "33035 449 Gonder"),
(18, "Hiwot", "Kebede", "female", 27, 4000, "2016-04-23", "IT", 6, "33022 455 Gonder"),
(19, "Desta", "Mola", "male", 23, 5000, "2010-09-20", "Finance", 1, "34033 306 Bahar_dar"),
(20, "Kassaw", "Tamirat", "male", 26, 4000, "2022-11-16", "Finance", 10, "34037 309 Bahar_dar"); 

commit;

++
||
++
++

> `6. Removing duplicate records by using` **backup table**.`This method is also the most useful method like a unique ID` <br> 
      >  `   method to remove any duplicate records whether data contains multiple duplicate records or duplicate IDs.`

Step1. Create a backup table.

In [45]:
%%sql
USE mydata_two;
CREATE TABLE employees_backup AS
SELECT MIN(emp_id) AS emp_id, first_name, last_name, gender, age, salary, hire_date, department, manager_id, address FROM employees
GROUP BY first_name, last_name, gender, age, salary, hire_date, department, manager_id, address;

++
||
++
++

Step2. Identify the total records and distinct records from the employees table to compare with the employees_backup table.

In [46]:
%%sql

SELECT 
     COUNT(*) AS Total_records,
     COUNT(DISTINCT first_name, last_name) AS Distinct_records
FROM employees;

+---------------+------------------+
| Total_records | Distinct_records |
+---------------+------------------+
|       21      |        17        |
+---------------+------------------+

Step2. verify the removal of all duplicate records from the employees_backup table.
       IF all duplicate records are removed, the total records must be equal to the distinct records.

In [47]:
%%sql

SELECT 
     COUNT(*) AS Total_records,
     COUNT(DISTINCT first_name, last_name) AS Distinct_records
FROM employees_backup;

+---------------+------------------+
| Total_records | Distinct_records |
+---------------+------------------+
|       17      |        17        |
+---------------+------------------+

Step3. Drop the employees table. and rename the employees_backup table As employees.

In [48]:
%%sql
USE mydata_two;
DROP TABLE employees;
COMMIT;

++
||
++
++

Step4. Rename the employees_backup table to the original table name 'employees'

In [49]:
%%sql
USE mydata_two;
RENAME TABLE employees_backup To employees;
COMMIT;

++
||
++
++

Step5. check, the table name is renamed to 'employees'.

In [50]:
%%sql

SELECT * from employees
LIMIT 5;

+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
| emp_id | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |        address        |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
|   1    |  Tamirat   |   Ketema  |  male  |  46 |  6000  | 2012-10-25 |    None    |    None    |    33021 456 Gonder   |
|   2    |    Bety    |    Ayle   | female |  26 |  5000  | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  |
|   3    |   Aragaw   |    Mola   |  male  |  25 |  4500  | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor |
|   4    |   Alemu    |   Asmar   |  male  |  24 |  4500  | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa |
|   5    |   Hiwot    |   Kebede  | female |  27 |  4000  | 2016-04-23 |     IT     |     6      |    33022 455 Gonder   |
+--------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+

### C. DATA TRANSFORMATION

##### Change the data types

In [51]:
%%sql 
USE mydata_two;

ALTER TABLE employees
MODIFY salary FLOAT, 
MODIFY hire_date DATE;

COMMIT;

++
||
++
++

Verify that the data types(salary and hire_date) are changed.

In [52]:
%%sql

DESCRIBE employees;

+------------+-------------+------+-----+---------+-------+
|   Field    |     Type    | Null | Key | Default | Extra |
+------------+-------------+------+-----+---------+-------+
|   emp_id   |     int     | YES  |     |   None  |       |
| first_name | varchar(50) | YES  |     |   None  |       |
| last_name  | varchar(50) | YES  |     |   None  |       |
|   gender   | varchar(10) | YES  |     |   None  |       |
|    age     |     int     | YES  |     |   None  |       |
|   salary   |    float    | YES  |     |   None  |       |
| hire_date  |     date    | YES  |     |   None  |       |
| department | varchar(50) | YES  |     |   None  |       |
| manager_id |     int     | YES  |     |   None  |       |
|  address   | varchar(50) | YES  |     |   None  |       |
+------------+-------------+------+-----+---------+-------+
Truncated to displaylimit of 10.

##### Merge columns

Step1.Add a new column for merging columns(first_name and last_name) as "full_name".

In [53]:
%%sql

USE mydata_two;

ALTER TABLE employees
ADD COLUMN full_name VARCHAR(50) AFTER emp_id;

COMMIT;

++
||
++
++

Step2. Verfiy that the full_name column is created.

In [54]:
%%sql

SELECT * FROM employees
LIMIT 2;

+--------+-----------+------------+-----------+--------+-----+--------+------------+------------+------------+---------------------+
| emp_id | full_name | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |       address       |
+--------+-----------+------------+-----------+--------+-----+--------+------------+------------+------------+---------------------+
|   1    |    None   |  Tamirat   |   Ketema  |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |   33021 456 Gonder  |
|   2    |    None   |    Bety    |    Ayle   | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      | 34034 304 Bahar_dar |
+--------+-----------+------------+-----------+--------+-----+--------+------------+------------+------------+---------------------+

Step3. insert the values of merging columns into full_name column.

In [64]:
%%sql

USE mydata_two;

UPDATE employees
SET full_name = CONCAT(first_name, ' ', last_name);

++
||
++
++

Step4. Verify that the values are inserted into the column full_name.

In [56]:
%%sql

SELECT * FROM employees
LIMIT 5;

+--------+----------------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
| emp_id |   full_name    | first_name | last_name | gender | age | salary | hire_date  | department | manager_id |        address        |
+--------+----------------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+
|   1    | Tamirat Ketema |  Tamirat   |   Ketema  |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |    33021 456 Gonder   |
|   2    |   Bety Ayle    |    Bety    |    Ayle   | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  |
|   3    |  Aragaw Mola   |   Aragaw   |    Mola   |  male  |  25 | 4500.0 | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor |
|   4    |  Alemu Asmar   |   Alemu    |   Asmar   |  male  |  24 | 4500.0 | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa |
|   5    |  Hiwot Kebede  |   Hiwot    |   Kebede  | female |  27 | 4000.0 | 2016-04-23 |     IT     |     6      |    33022 455 Gonder   |
+--------+----------------+------------+-----------+--------+-----+--------+------------+------------+------------+-----------------------+

Step5. Drop the merged columns(first-name and last_name).

In [57]:
%%sql

USE mydata_two;

ALTER TABLE employees
DROP COLUMN first_name,
DROP COLUMN last_name;

COMMIT;

++
||
++
++

Step6. Verify that the first_name and last_name columns are dropped.

In [58]:
%%sql

SELECT * FROM employees
LIMIT 5;

+--------+----------------+--------+-----+--------+------------+------------+------------+-----------------------+
| emp_id |   full_name    | gender | age | salary | hire_date  | department | manager_id |        address        |
+--------+----------------+--------+-----+--------+------------+------------+------------+-----------------------+
|   1    | Tamirat Ketema |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |    33021 456 Gonder   |
|   2    |   Bety Ayle    | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      |  34034 304 Bahar_dar  |
|   3    |  Aragaw Mola   |  male  |  25 | 4500.0 | 2000-03-17 |     IT     |     6      | 45076 206 Debre_tabor |
|   4    |  Alemu Asmar   |  male  |  24 | 4500.0 | 2000-04-02 | Marketing  |     2      | 55076 809 Addis_Ababa |
|   5    |  Hiwot Kebede  | female |  27 | 4000.0 | 2016-04-23 |     IT     |     6      |    33022 455 Gonder   |
+--------+----------------+--------+-----+--------+------------+------------+------------+-----------------------+

##### Split Column

Step1.Add three new columns for splitting column(address) as "zip code, postal code and city".

In [62]:
%%sql

USE mydata_two;

ALTER TABLE employees
ADD COLUMN zip_code VARCHAR(50), 
ADD COLUMN postal_code VARCHAR(50), 
ADD COLUMN city VARCHAR(50) ;

    COMMIT;

++
||
++
++

Step2. Verfiy that the new columns are created.

In [63]:
%%sql

SELECT * FROM employees
LIMIT 2;

+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+------+
| emp_id |   full_name    | gender | age | salary | hire_date  | department | manager_id |       address       | zip_code | postal_code | city |
+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+------+
|   1    | Tamirat Ketema |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |   33021 456 Gonder  |   None   |     None    | None |
|   2    |   Bety Ayle    | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      | 34034 304 Bahar_dar |   None   |     None    | None |
+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+------+

Step3. insert the values that are separated by white-space delimeter of splited column(address) into the new three columns .

In [ ]:
%%sql

USE mydata_two;

UPDATE employees
SET zip_code = SUBSTRING_INDEX(address, ' ', 1),
    postal_code = SUBSTRING_INDEX(SUBSTRING_INDEX(address, ' ', 2), ' ', -1),
    city = SUBSTRING_INDEX(address, ' ', -1);

Step4. Verify that the values are inserted into the new columns.

In [65]:
%%sql

SELECT * FROM employees
LIMIT 2;

+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+-----------+
| emp_id |   full_name    | gender | age | salary | hire_date  | department | manager_id |       address       | zip_code | postal_code |    city   |
+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+-----------+
|   1    | Tamirat Ketema |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |   33021 456 Gonder  |  33021   |     456     |   Gonder  |
|   2    |   Bety Ayle    | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      | 34034 304 Bahar_dar |  34034   |     304     | Bahar_dar |
+--------+----------------+--------+-----+--------+------------+------------+------------+---------------------+----------+-------------+-----------+

Step5. Drop the splitted column(address).

In [66]:
%%sql

USE mydata_two;

ALTER TABLE employees
DROP COLUMN address;

COMMIT;

++
||
++
++

Step6. Verify that the splitted column address is dropped.

In [68]:
%%sql

SELECT * FROM employees
LIMIT 2;

+--------+----------------+--------+-----+--------+------------+------------+------------+----------+-------------+-----------+
| emp_id |   full_name    | gender | age | salary | hire_date  | department | manager_id | zip_code | postal_code |    city   |
+--------+----------------+--------+-----+--------+------------+------------+------------+----------+-------------+-----------+
|   1    | Tamirat Ketema |  male  |  46 | 6000.0 | 2012-10-25 |    None    |    None    |  33021   |     456     |   Gonder  |
|   2    |   Bety Ayle    | female |  26 | 5000.0 | 2013-06-10 | Marketing  |     1      |  34034   |     304     | Bahar_dar |
+--------+----------------+--------+-----+--------+------------+------------+------------+----------+-------------+-----------+

### D. DATA RETRIEVING

##### using window function

Fetch all the employees who earn the maximum salary in each department along with emp_id, full_name, salary and department.

In [41]:
%%sql
WITH department_max_salary AS(
        SELECT *, 
            RANK() OVER(PARTITION BY department ORDER BY salary DESC) AS rk
        FROM employees
    )
SELECT 
    emp_id,
    full_name,
    salary,
    department
FROM department_max_salary
WHERE department IS NOT NULL AND rk = 1;

+--------+-----------------+--------+------------+
| emp_id |    full_name    | salary | department |
+--------+-----------------+--------+------------+
|   10   |    Desta Mola   | 5000.0 |  Finance   |
|   14   |    Sema Bitew   | 5000.0 |     HR     |
|   6    | Getachew Kebede | 5000.0 |     IT     |
|   2    |    Bety Ayle    | 5000.0 | Marketing  |
+--------+-----------------+--------+------------+

Fetch all the employees who earn the second maximum salary in each department along with emp_id, full_name, salary and department.

In [42]:
%%sql
WITH department_max_salary AS(
        SELECT *,  
            RANK() OVER(PARTITION BY department ORDER BY salary DESC) AS rk
        FROM employees
          )
SELECT 
     emp_id,
     full_name,
     salary,
     department  
FROM department_max_salary
WHERE department IS NOT NULL AND rk = 2;

+--------+----------------+--------+------------+
| emp_id |   full_name    | salary | department |
+--------+----------------+--------+------------+
|   12   | Ayalew Tamire  | 4000.0 |  Finance   |
|   16   | Kassaw Tamirat | 4000.0 |  Finance   |
|   8    |  Meseret Ayle  | 3500.0 |     HR     |
|   3    |  Aragaw Mola   | 4500.0 |     IT     |
|   4    |  Alemu Asmar   | 4500.0 | Marketing  |
|   7    | Kidist Kebede  | 4500.0 | Marketing  |
+--------+----------------+--------+------------+

Fetch the first two departments that earn the highest total salary.

In [46]:
%%sql
SELECT
    department,
    FORMAT(Total_salary_by_department, 0) AS Total_salary_by_department
FROM(
        SELECT 
              department,
              SUM(salary) as Total_salary_by_department
        FROM employees
        GROUP BY department
        ORDER BY Total_salary_by_department DESC
        LIMIT 2
     ) AS Subquery;

+------------+----------------------------+
| department | Total_salary_by_department |
+------------+----------------------------+
| Marketing  |           17,500           |
|     IT     |           16,700           |
+------------+----------------------------+

##### USING RECURSIVE QUERY

1. Recursive from a higher to a lower position.

Fetch all employees with their managers, and consider that the top-level manager's manager_id is null.

In [3]:
%%sql

WITH RECURSIVE manager_hierarchy AS(
    SELECT 
        emp_id,
        full_name,
        manager_id,
        1 AS emp_level -- Assume that level 1 here is the highest hierarchical level
    FROM employees 
    WHERE manager_id IS NULL
    UNION ALL
    SELECT
        E.emp_id,
        E.full_name,
        E.manager_id,
        MH.emp_level+1 AS emp_level
    FROM manager_hierarchy  MH
    JOIN employees E
    ON MH.emp_id = E.manager_id
    )

SELECT 
    GROUP_CONCAT(mh.full_name) AS employee_name,
    MH.emp_level,
    E.full_name AS manager_name     
FROM manager_hierarchy MH
LEFT JOIN employees E 
ON E.emp_id = MH.manager_id
GROUP BY manager_name, emp_level
ORDER BY emp_level;

+-------------------------------------------------+-----------+-----------------+
|                  employee_name                  | emp_level |   manager_name  |
+-------------------------------------------------+-----------+-----------------+
|                  Tamirat Ketema                 |     1     |       None      |
| Bety Ayle,Getachew Kebede,Desta Mola,Sema Bitew |     2     |  Tamirat Ketema |
|     Alemu Asmar,Kidist Kebede,Debebe Kassie     |     3     |    Bety Ayle    |
|    Ayalew Tamire,Kassaw Tamirat,Belay Ketema    |     3     |    Desta Mola   |
|     Aragaw Mola,Hiwot Kebede,Ketemaw Ketema     |     3     | Getachew Kebede |
|     Meseret Ayle,Gashaw Kebede,Abebe Kassaw     |     3     |    Sema Bitew   |
+-------------------------------------------------+-----------+-----------------+

Fetch all employees under the hierarchical position of manager "Tamirat Ketema".

In [37]:
%%sql

WITH RECURSIVE manager_hierarchy AS(
    SELECT 
        emp_id,
        full_name,
        manager_id,
        1 AS emp_level -- Assume level 1 here is the highest hierarchical level
    FROM employees 
    WHERE full_name = "Tamirat Ketema" 
    UNION ALL
    SELECT
        E.emp_id,
        E.full_name,
        E.manager_id,
        MH.emp_level+1 AS emp_level
    FROM manager_hierarchy  MH
    JOIN employees E
    ON MH.emp_id = E.manager_id
    )
  
SELECT 
    E.full_name AS manager_name,
    GROUP_CONCAT(eh.full_name) AS employee_name,
    MH.emp_level   
FROM manager_hierarchy MH
JOIN employees E 
ON E.emp_id = MH.manager_id
GROUP BY manager_name, emp_level
ORDER BY emp_level;

+-----------------+-------------------------------------------------+-----------+
|   manager_name  |                  employee_name                  | emp_level |
+-----------------+-------------------------------------------------+-----------+
|  Tamirat Ketema | Sema Bitew,Desta Mola,Getachew Kebede,Bety Ayle |     2     |
|    Bety Ayle    |     Debebe Kassie,Kidist Kebede,Alemu Asmar     |     3     |
|    Desta Mola   |    Belay Ketema,Kassaw Tamirat,Ayalew Tamire    |     3     |
| Getachew Kebede |     Ketemaw Ketema,Hiwot Kebede,Aragaw Mola     |     3     |
|    Sema Bitew   |     Abebe Kassaw,Gashaw Kebede,Meseret Ayle     |     3     |
+-----------------+-------------------------------------------------+-----------+

2. Recursive from a lower to a higher position.

Fetch all hierarchical managers of an employee whose `emp_id` = 9.

In [13]:
%%sql

WITH RECURSIVE employee_hierarchy AS(
    SELECT 
        emp_id,
        full_name,
        manager_id,
        1 AS emp_level -- Assume that level 1 here is the lowest hierarchical level.
    FROM employees 
    WHERE emp_id =9
    UNION ALL
    SELECT
        E.emp_id,
        E.full_name,
        E.manager_id,
        EH.emp_level+1 AS emp_level
    FROM employee_hierarchy EH
    JOIN employees E
    ON E.emp_id = EH.manager_id
    )
SELECT 
    EH.emp_id,
    EH.full_name AS employee_name,
    EH.full_name AS manager_name,
    emp_level   
FROM employee_hierarchy EH
JOIN employees E
ON E.emp_id = EH.manager_id 
ORDER BY emp_level;

+--------+---------------+----------------+-----------+
| emp_id | employee_name |  manager_name  | emp_level |
+--------+---------------+----------------+-----------+
|   9    | Gashaw Kebede |   Sema Bitew   |     1     |
|   14   |   Sema Bitew  | Tamirat Ketema |     2     |
+--------+---------------+----------------+-----------+